tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.01 0 0 );

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform ( 0.01 0 0 );
    }
    maxX
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
    }
    minY
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    maxY
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    minZ
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    maxZ
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}

// ************************************************************************* //
